{
  "What is HMS?": "Hydrologic Micro Services, HMS, is a watershed modeling system comprised of data provisioning and modeling components and workflows to facilitate environmental modeling.",
  "How can I use the HMS?": "The components can be accessed through the web interface or directly through the web API, <a href=\"https://github.com/quanted/hms\" target=\"_blank\">desktop libraries</a>, request details are provided through the <a href='/hms/api_doc/' target='_blank'>Swagger OpenAPI Documentation</a>.",
  "How do I use the HMS web interface": "All HMS component and workflow web pages have a consistent presentation structure consisting of four pages: <i>Overview</i>, <i>Data Request</i>, <i>Output Data</i>, and <i>Data Algorithms</i>. <br/><br/>The <i>Overview</i> page has five collapsible panels: <i>Description</i> panel with a brief description of the component/workflow, <i>Input Parameters</i> panel with details of the input parameters on the <i>Data Request</i> page, <i>Output Parameters</i> with a brief description of output objects produced by the component/workflow, <i>Web Service Details</i> panel with link to the swagger OpenAPI documentation, and <i>Code Samples</i> panel with links to web services sample client codes.<br/><br/><i>Data Request</i> page has the web form where the user can enter values of input parameters and run the component/workflow. When the user submits a request for a previously submitted task, by the task ID, the user will be directed to the <i>Output Data</i> page showing the data for the specified task ID provided by HMS. The user has the option of waiting on the <i>Output Data</i> page until the task finishes and the outputs are shown. The other option for the user is to copy the Task ID and leave the page and come back later and click on the <i>Data Request</i> page where outputs can be retrieved by entering the task ID.<br/><br/><i>Data Algorithms</i> page provides details about the algorithms and sources of data related to the component/workflow.",
  "Who are the intended users for HMS?": "The target users are hydrological and water quality modelers and analysts.",
  "Can I build my own custom workflow within the HMS website?": "HMS users can use the system components and workflows directly or build their own workflows by linking the components. Workflows can be either desktop or web-based applications outside HMS web site. Workflows on HMS web site are simple and mostly serve the purpose of demonstration. Only HMS web site developers can build workflows on HMS web site.",
  "What is Constant Volume algorithm in stream flow hydrology?": "Constant Volume stream flow hydrology assumes that the volume in the stream remains constant i.e. flow-in=flow-out. More details are available <a href='https://cfpub.epa.gov/si/si_public_record_report.cfm?Lab=NERL&dirEntryId=342907' target='_blank'>here</a>."
}